#+TITLE: The Morning Routine
#+AUTHOR: Demo Author
#+DATE: 2025-01-15
#+LANGUAGE: en
#+STARTUP: overview
#+TODO: TODO(t) TOWRITE(h) TOREVIEW(j@/!) REDO(k@/!) RESTRUCTURE(n@/!) | FINISHED(l!) PURGE(ñ@/!)
#+COLUMNS: %40ITEM(Task) %12WORDCOUNT %12PoV %20Plot %40Summary %40Comment
#+MACRO: scene-break SCENE-BREAK

* stats :ignore:noexport:
:PROPERTIES:
:WORDCOUNT: 2847
:END:
# This shows your word count by sections:
# Table to keep track of the words by section
#+BEGIN: org-generate-wordcount-table
| Heading       | Wordcount |
|---------------+-----------|
| Act I         |      1456 |
| Chapter 1     |       876 |
| Scene 1       |       487 |
| Scene 2       |       389 |
| Chapter 2     |       580 |
| Scene 1       |       580 |
| Act II        |       876 |
| Chapter 3     |       876 |
| Scene 1       |       876 |
| Act III       |       515 |
| Chapter 5     |       515 |
| Scene 1       |       515 |
#+END:

# If you want to track here a daily word count, you can use the
# =org-tracktable-insert-table= command with an empty line at point.
# For more details, check the [[https://codeberg.org/jcastp/org-tracktable/src/branch/main/README.org][org-tracktable documentation]] at
# https://codeberg.org/jcastp/org-tracktable/src/branch/main/README.org
#+NAME: tracktable
|---+------------------+-------+-----+---------------+------------|
| * | date             | start | end | total (today) | comment    |
|---+------------------+-------+-----+---------------+------------|
|   | initial count    |     0 |   0 |             0 |            |
|   | 2025-01-15       |     0 | 892 |           892 | First day  |
|   | 2025-01-16       |   892 | 1654 |           762 | Good flow  |
|   | 2025-01-17       |  1654 | 2847 |          1193 | Finished 3 |
|---+------------------+-------+-----+---------------+------------|
#+TBLFM: @2$2=initial count::$2='(org-tracktable-stamp)::@2$3=0::$3=(@-1$4)::$4='(org-tracktable-current-count)::$5=$4-$3

